# Описание решения задачи
## Задача
    Нужно написать программу, которая из имеющегося массива строк, 
    формирует новый массив из строк, длина которых задается пользователем.
## Ввод данных
Для ввода данных с клавиатуры используется встроенный метод  
`Console.ReadLine()`.
1. Пользователь вводит с клавиатуры размер массива, состоящего из строк. Программа проверяет введенные данные с помощью метода  
`int CheckNumber (int num), num - проверяемое число`.
2. Пользователь вводит с клавиатуры строки массива `string[] arrayText`. Происходит заполнение массива с помощью метода  
`string[] FillArray()`.
3. Пользователь вводит с клавиатуры длину строк `int lengthString` для нового массива. Программа проверяет введенные данные с помощью метода  
`int CheckNumber (int num)`.
## Формирование нового массива
Формирование нового массива `string[] arrayNew`  происходит с помощью метода  
`string[] FormingNewArray(string[] arr, int len), в метод передается заданый массив и длина строк нового массива`.
* Программа проходит по элементам массива и длину каждой строки массива сравнивает с длиной строки нового массива.
* Если длина строки в массиве меньше или равна длине строки нового массива, то такая строка записывается в новый массив и программа переходит к следующей строке массива.
* Если условие не вполняется, то программа переходит к следующей строке массива.
## Вывод данных
Для вывода данных на экран используется встроенный метод  
`Console.WriteLine()`.  
На экран выводится заданный массив `arrayText{}` и новый массив `arrayNew{}`.   
Вывод осуществляет метод  
`void PrintArray(string[] arr), в метод передается массив, который нужно вывести`